#### NavisworksCoordinates Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing possible Coordinates of Navisworks Exporter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum NavisworksCoordinates ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration NavisworksCoordinates ``` |

| Visual C++ |
| --- |
| ``` public enum class NavisworksCoordinates ``` |

# Members

| Member name | Description |
| --- | --- |
| Internal | Use Revit internal coordinates. |
| Shared | Shared coordinates can be viewed and modified outside of Revit. |

# See Also

Autodesk.Revit.DB Namespace